[
  {
    "title": "Windows 10 KB5058481 update brings seconds back to calendar flyout",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-10-kb5058481-update-brings-seconds-back-to-calendar-flyout/",
    "date": "2025-05-28T22:57:26.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has released the optional KB5058481 preview cumulative update for Windows 10 22H2 with seven changes, including restoring seconds to the time display in the calendar flyout for those who pre..."
  },
  {
    "title": "Windows 11 KB5058499 update rolls out new Share and Click to Do features",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5058499-update-rolls-out-new-share-and-click-to-do-features/",
    "date": "2025-05-28T22:19:54.000Z",
    "source": "Bleeping Computer",
    "summary": "​​Microsoft has released the KB5058499 preview cumulative update for Windows 11 24H2 with forty-eight new features or changes, with many gradually rolling out, such as the new Windows Share feature an..."
  },
  {
    "title": "APT41 malware abuses Google Calendar for stealthy C2 communication",
    "link": "https://www.bleepingcomputer.com/news/security/apt41-malware-abuses-google-calendar-for-stealthy-c2-communication/",
    "date": "2025-05-28T22:04:04.000Z",
    "source": "Bleeping Computer",
    "summary": "The Chinese APT41 hacking group uses a new malware named 'ToughProgress' that abuses Google Calendar for command-and-control (C2) operations, hiding malicious activity behind a trusted cloud service. ..."
  },
  {
    "title": "Hundreds of Web Apps Have Full Access to Microsoft OneDrive Files",
    "link": "https://www.darkreading.com/application-security/hundreds-web-apps-full-access-onedrive-files",
    "date": "2025-05-28T21:36:00.000Z",
    "source": "Dark Reading",
    "summary": "Researchers at Oasis Security say the problem has to do with OneDrive File Picker having overly broad permissions...."
  },
  {
    "title": "New PumaBot botnet brute forces SSH credentials to breach devices",
    "link": "https://www.bleepingcomputer.com/news/security/new-pumabot-botnet-brute-forces-ssh-credentials-to-breach-devices/",
    "date": "2025-05-28T19:59:38.000Z",
    "source": "Bleeping Computer",
    "summary": "A newly discovered Go-based Linux botnet malware named PumaBot is brute-forcing SSH credentials on embedded IoT devices to deploy malicious payloads. [...]..."
  },
  {
    "title": "Interlock ransomware gang deploys new NodeSnake RAT on universities",
    "link": "https://www.bleepingcomputer.com/news/security/interlock-ransomware-gang-deploys-new-nodesnake-rat-on-universities/",
    "date": "2025-05-28T18:14:01.000Z",
    "source": "Bleeping Computer",
    "summary": "The Interlock ransomware gang is deploying a previously undocumented remote access trojan (RAT) named NodeSnake against educational institutes for persistent access to corporate networks. [...]..."
  },
  {
    "title": "Implementing Secure by Design Principles for AI",
    "link": "https://www.darkreading.com/vulnerabilities-threats/secure-design-principles-ai",
    "date": "2025-05-28T18:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Harnessing AI's full transformative potential safely and securely requires more than an incremental enhancement of existing cybersecurity practices. A Secure by Design approach represents the best pat..."
  },
  {
    "title": "Pakistan Arrests 21 in ‘Heartsender’ Malware Service",
    "link": "https://krebsonsecurity.com/2025/05/pakistan-arrests-21-in-heartsender-malware-service/",
    "date": "2025-05-28T17:41:47.000Z",
    "source": "Krebs on Security",
    "summary": "Authorities in Pakistan have arrested 21 individuals accused of operating \"Heartsender,\" a once popular spam and malware dissemination service that operated for more than a decade. The main clientele ..."
  },
  {
    "title": "Iranian Hacker Pleads Guilty in $19 Million Robbinhood Ransomware Attack on Baltimore",
    "link": "https://thehackernews.com/2025/05/iranian-hacker-pleads-guilty-in-19.html",
    "date": "2025-05-28T17:20:00.000Z",
    "source": "The Hacker News",
    "summary": "An Iranian national has pleaded guilty in the U.S. over his involvement in an international ransomware and extortion scheme involving the Robbinhood ransomware.\nSina Gholinejad (aka Sina Ghaaf), 37, a..."
  },
  {
    "title": "Botnet hacks 9,000+ ASUS routers to add persistent SSH backdoor",
    "link": "https://www.bleepingcomputer.com/news/security/botnet-hacks-9-000-plus-asus-routers-to-add-persistent-ssh-backdoor/",
    "date": "2025-05-28T16:44:36.000Z",
    "source": "Bleeping Computer",
    "summary": "Over 9,000 ASUS routers are compromised by a novel botnet dubbed \"AyySSHush\" that was also observed targeting SOHO routers from Cisco, D-Link, and Linksys. [...]..."
  },
  {
    "title": "Dark Partners cybercrime gang fuels large-scale crypto heists",
    "link": "https://www.bleepingcomputer.com/news/security/dark-partners-cybercrime-gang-fuels-large-scale-crypto-heists/",
    "date": "2025-05-28T16:39:13.000Z",
    "source": "Bleeping Computer",
    "summary": "A sprawling network of fake AI, VPN, and crypto software download sites is being used by the \"Dark Partner\" threat actors to conduct a crypto theft attacks worldwide. [...]..."
  },
  {
    "title": "Czech Republic Blames China-Linked APT31 Hackers for 2022 Cyberattack",
    "link": "https://thehackernews.com/2025/05/czech-republic-blames-china-linked.html",
    "date": "2025-05-28T16:01:00.000Z",
    "source": "The Hacker News",
    "summary": "The Czech Republic on Wednesday formally accused a threat actor associated with the People's Republic of China (PRC) of targeting its Ministry of Foreign Affairs.\nIn a public statement, the government..."
  },
  {
    "title": "Cellcom Restores Regional Mobile Services After Cyberattack",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/cellcom-restores-regional-mobile-services-cyberattack",
    "date": "2025-05-28T15:33:33.000Z",
    "source": "Dark Reading",
    "summary": "Customers in parts of Wisconsin and Michigan could not make calls or send text messages for nearly a week after an incident on May 14, and service is still intermittent in some areas...."
  },
  {
    "title": "Is that extension safe? This free tool lets you know before you install",
    "link": "https://www.zdnet.com/article/is-that-extension-safe-this-free-site-lets-you-know-before-you-install/",
    "date": "2025-05-28T14:54:09.000Z",
    "source": "ZDNet Security",
    "summary": "Don't install that unknown extension until you've checked out its reputation. Here's how to do that...."
  },
  {
    "title": "Czechia blames China for Ministry of Foreign Affairs cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/czechia-blames-china-for-ministry-of-foreign-affairs-cyberattack/",
    "date": "2025-05-28T14:39:25.000Z",
    "source": "Bleeping Computer",
    "summary": "The Czech Republic says the Chinese-backed APT31 hacking group was behind cyberattacks targeting the country's Ministry of Foreign Affairs and critical infrastructure organizations. [...]..."
  },
  {
    "title": "Why Take9 Won't Improve Cybersecurity",
    "link": "https://www.darkreading.com/cybersecurity-operations/why-take9-will-not-improve-cybersecurity",
    "date": "2025-05-28T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "The latest cybersecurity awareness campaign asks users to pause for nine seconds before clicking — but this approach misplaces responsibility and ignores the real problems of system design...."
  },
  {
    "title": "Microsoft OneDrive File Picker Flaw Grants Apps Full Cloud Access — Even When Uploading Just One File",
    "link": "https://thehackernews.com/2025/05/microsoft-onedrive-file-picker-flaw.html",
    "date": "2025-05-28T13:41:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered a security flaw in Microsoft's OneDrive File Picker that, if successfully exploited, could allow websites to access a user's entire cloud storage content, as ..."
  },
  {
    "title": "Microsoft introduces new Windows backup tool for businesses",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-introduces-new-windows-backup-tool-for-businesses/",
    "date": "2025-05-28T13:09:15.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has introduced Windows Backup for Organizations, a new backup tool for enterprises that simplifies backups and makes the transition to Windows 11 easier. [...]..."
  },
  {
    "title": "Have Your Say: Dark Reading Seeks Your Input",
    "link": "https://www.darkreading.com/threat-intelligence/have-your-say-dark-reading-seeks-your-input",
    "date": "2025-05-28T13:08:37.000Z",
    "source": "Dark Reading",
    "summary": "Dark Reading is offering its readers the opportunity to tell us how we're doing via a new survey...."
  },
  {
    "title": "New PumaBot Botnet Targets Linux IoT Devices to Steal SSH Credentials and Mine Crypto",
    "link": "https://thehackernews.com/2025/05/new-pumabot-botnet-targets-linux-iot.html",
    "date": "2025-05-28T12:30:00.000Z",
    "source": "The Hacker News",
    "summary": "Embedded Linux-based Internet of Things (IoT) devices have become the target of a new botnet dubbed PumaBot.\nWritten in Go, the botnet is designed to conduct brute-force attacks against SSH instances ..."
  },
  {
    "title": "Zscaler Announces Deal to Acquire Red Canary",
    "link": "https://www.darkreading.com/threat-intelligence/zscaler-announces-deal-acquire-red-canary",
    "date": "2025-05-28T12:23:49.000Z",
    "source": "Dark Reading",
    "summary": "The August acquisition will bring together Red Canary's extensive integration ecosystem with Zscaler's cloud transaction data to deliver an AI-powered security operations platform...."
  },
  {
    "title": "Microsoft wants Windows to update all software on your PC",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-wants-windows-to-update-all-software-on-your-pc/",
    "date": "2025-05-28T12:15:03.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has introduced a new update orchestration platform built on the existing Windows Update infrastructure, which aims to unify the updating system for all apps, drivers, and system components o..."
  },
  {
    "title": "From Infection to Access: A 24-Hour Timeline of a Modern Stealer Campaign",
    "link": "https://thehackernews.com/2025/05/from-infection-to-access-24-hour.html",
    "date": "2025-05-28T11:25:00.000Z",
    "source": "The Hacker News",
    "summary": "Stealer malware no longer just steals passwords. In 2025, it steals live sessions—and attackers are moving faster and more efficiently than ever.\nWhile many associate account takeovers with personal s..."
  },
  {
    "title": "Mimo Hackers Exploit CVE-2025-32432 in Craft CMS to Deploy Cryptominer and Proxyware",
    "link": "https://thehackernews.com/2025/05/mimo-hackers-exploit-cve-2025-32432-in.html",
    "date": "2025-05-28T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "A financially motivated threat actor has been observed exploiting a recently disclosed remote code execution flaw affecting the Craft Content Management System (CMS) to deploy multiple payloads, inclu..."
  },
  {
    "title": "Apple blocked over $9 billion in App Store fraud in five years",
    "link": "https://www.bleepingcomputer.com/news/apple/apple-blocked-over-9-billion-in-apap-store-fraud-since-2020/",
    "date": "2025-05-28T10:18:34.000Z",
    "source": "Bleeping Computer",
    "summary": "Apple says it blocked over $9 billion in fraudulent App Store transactions over the last five years, with over $2 billion in potentially fraudulent sanctions prevented in 2024 alone. [...]..."
  },
  {
    "title": "How 'Browser-in-the-Middle' Attacks Steal Sessions in Seconds",
    "link": "https://thehackernews.com/2025/05/how-browser-in-middle-attacks-steal.html",
    "date": "2025-05-28T09:32:00.000Z",
    "source": "The Hacker News",
    "summary": "Would you expect an end user to log on to a cybercriminal’s computer, open their browser, and type in their usernames and passwords? Hopefully not! But that’s essentially what happens if they fall vic..."
  },
  {
    "title": "How to disable ACR on your TV (and why you shouldn't wait to do it)",
    "link": "https://www.zdnet.com/article/how-to-disable-acr-on-your-tv-and-why-you-shouldnt-wait-to-do-it/",
    "date": "2025-05-28T09:30:14.000Z",
    "source": "ZDNet Security",
    "summary": "Smarter TV operating systems offer added convenience, but they also introduce new privacy concerns, particularly around automatic content recognition (ACR)...."
  },
  {
    "title": "251 Amazon-Hosted IPs Used in Exploit Scan Targeting ColdFusion, Struts, and Elasticsearch",
    "link": "https://thehackernews.com/2025/05/251-amazon-hosted-ips-used-in-exploit.html",
    "date": "2025-05-28T09:23:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a coordinated cloud-based scanning activity that targeted 75 distinct \"exposure points\" earlier this month.\nThe activity, observed by GreyNoise on M..."
  },
  {
    "title": "Apple Blocks $9 Billion in Fraud Over 5 Years Amid Rising App Store Threats",
    "link": "https://thehackernews.com/2025/05/apple-blocks-9-billion-in-fraud-over-5.html",
    "date": "2025-05-28T06:11:00.000Z",
    "source": "The Hacker News",
    "summary": "Apple on Tuesday revealed that it prevented over $9 billion in fraudulent transactions in the last five years, including more than $2 billion in 2024 alone.\nThe company said the App Store is confronte..."
  },
  {
    "title": "Indian Police Arrest Cybercrime Gang Copycats of Myanmar Biz Model",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/indian-police-arrest-cybercrime-gang-copycats-myanmar-biz-model",
    "date": "2025-05-28T03:30:00.000Z",
    "source": "Dark Reading",
    "summary": "The region offers attractive conditions: a large pool of tech workers, economic disparity, and weak enforcement of cybercrime laws — all of which attract businesses legitimate and shady...."
  }
]